Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025dal169.h
extern volatile __SBT14RD0bits_t SBT14RD0bits __asm__ ("SBT14RD0") __attribute__((section("sfrs"), address(0xBF918850)));
#define SBT14WR0 SBT14WR0
extern volatile uint32_t   SBT14WR0 __attribute__((section("sfrs"), address(0xBF918858)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT14WR0bits_t;
extern volatile __SBT14WR0bits_t SBT14WR0bits __asm__ ("SBT14WR0") __attribute__((section("sfrs"), address(0xBF918858)));
#define SBT14REG1 SBT14REG1
extern volatile uint32_t   SBT14REG1 __attribute__((section("sfrs"), address(0xBF918860)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT14REG1bits_t;
extern volatile __SBT14REG1bits_t SBT14REG1bits __asm__ ("SBT14REG1") __attribute__((section("sfrs"), address(0xBF918860)));
#define SBT14RD1 SBT14RD1
extern volatile uint32_t   SBT14RD1 __attribute__((section("sfrs"), address(0xBF918870)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT14RD1bits_t;
extern volatile __SBT14RD1bits_t SBT14RD1bits __asm__ ("SBT14RD1") __attribute__((section("sfrs"), address(0xBF918870)));
#define SBT14WR1 SBT14WR1
extern volatile uint32_t   SBT14WR1 __attribute__((section("sfrs"), address(0xBF918878)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT14WR1bits_t;
extern volatile __SBT14WR1bits_t SBT14WR1bits __asm__ ("SBT14WR1") __attribute__((section("sfrs"), address(0xBF918878)));
#define SBT15ELOG1 SBT15ELOG1
extern volatile uint32_t   SBT15ELOG1 __attribute__((section("sfrs"), address(0xBF918C20)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT15ELOG1bits_t;
extern volatile __SBT15ELOG1bits_t SBT15ELOG1bits __asm__ ("SBT15ELOG1") __attribute__((section("sfrs"), address(0xBF918C20)));
#define SBT15ELOG2 SBT15ELOG2
extern volatile uint32_t   SBT15ELOG2 __attribute__((section("sfrs"), address(0xBF918C24)));
typedef struct {
  uint32_t GROUP:2;
} __SBT15ELOG2bits_t;
extern volatile __SBT15ELOG2bits_t SBT15ELOG2bits __asm__ ("SBT15ELOG2") __attribute__((section("sfrs"), address(0xBF918C24)));
#define SBT15ECON SBT15ECON
extern volatile uint32_t   SBT15ECON __attribute__((section("sfrs"), address(0xBF918C28)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT15ECONbits_t;
extern volatile __SBT15ECONbits_t SBT15ECONbits __asm__ ("SBT15ECON") __attribute__((section("sfrs"), address(0xBF918C28)));
#define SBT15ECLRS SBT15ECLRS
extern volatile uint32_t   SBT15ECLRS __attribute__((section("sfrs"), address(0xBF918C30)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT15ECLRSbits_t;
extern volatile __SBT15ECLRSbits_t SBT15ECLRSbits __asm__ ("SBT15ECLRS") __attribute__((section("sfrs"), address(0xBF918C30)));
#define SBT15ECLRM SBT15ECLRM
extern volatile uint32_t   SBT15ECLRM __attribute__((section("sfrs"), address(0xBF918C38)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT15ECLRMbits_t;
extern volatile __SBT15ECLRMbits_t SBT15ECLRMbits __asm__ ("SBT15ECLRM") __attribute__((section("sfrs"), address(0xBF918C38)));
#define SBT15REG0 SBT15REG0
extern volatile uint32_t   SBT15REG0 __attribute__((section("sfrs"), address(0xBF918C40)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT15REG0bits_t;
extern volatile __SBT15REG0bits_t SBT15REG0bits __asm__ ("SBT15REG0") __attribute__((section("sfrs"), address(0xBF918C40)));
#define SBT15RD0 SBT15RD0
extern volatile uint32_t   SBT15RD0 __attribute__((section("sfrs"), address(0xBF918C50)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT15RD0bits_t;
extern volatile __SBT15RD0bits_t SBT15RD0bits __asm__ ("SBT15RD0") __attribute__((section("sfrs"), address(0xBF918C50)));
#define SBT15WR0 SBT15WR0
extern volatile uint32_t   SBT15WR0 __attribute__((section("sfrs"), address(0xBF918C58)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT15WR0bits_t;
extern volatile __SBT15WR0bits_t SBT15WR0bits __asm__ ("SBT15WR0") __attribute__((section("sfrs"), address(0xBF918C58)));
#define SBFLAG3 SBFLAG3
extern volatile uint32_t   SBFLAG3 __attribute__((section("sfrs"), address(0xBF920510)));
typedef struct {
  uint32_t T16PGV:1;
  uint32_t T0PGV3:1;
} __SBFLAG3bits_t;
extern volatile __SBFLAG3bits_t SBFLAG3bits __asm__ ("SBFLAG3") __attribute__((section("sfrs"), address(0xBF920510)));
#define SBT16ELOG1 SBT16ELOG1
extern volatile uint32_t   SBT16ELOG1 __attribute__((section("sfrs"), address(0xBF92C420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT16ELOG1bits_t;
extern volatile __SBT16ELOG1bits_t SBT16ELOG1bits __asm__ ("SBT16ELOG1") __attribute__((section("sfrs"), address(0xBF92C420)));
#define SBT16ELOG2 SBT16ELOG2
extern volatile uint32_t   SBT16ELOG2 __attribute__((section("sfrs"), address(0xBF92C424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT16ELOG2bits_t;
extern volatile __SBT16ELOG2bits_t SBT16ELOG2bits __asm__ ("SBT16ELOG2") __attribute__((section("sfrs"), address(0xBF92C424)));
#define SBT16ECON SBT16ECON
extern volatile uint32_t   SBT16ECON __attribute__((section("sfrs"), address(0xBF92C428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT16ECONbits_t;
extern volatile __SBT16ECONbits_t SBT16ECONbits __asm__ ("SBT16ECON") __attribute__((section("sfrs"), address(0xBF92C428)));
#define SBT16ECLRS SBT16ECLRS
extern volatile uint32_t   SBT16ECLRS __attribute__((section("sfrs"), address(0xBF92C430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT16ECLRSbits_t;
extern volatile __SBT16ECLRSbits_t SBT16ECLRSbits __asm__ ("SBT16ECLRS") __attribute__((section("sfrs"), address(0xBF92C430)));
#define SBT16ECLRM SBT16ECLRM
extern volatile uint32_t   SBT16ECLRM __attribute__((section("sfrs"), address(0xBF92C438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT16ECLRMbits_t;
extern volatile __SBT16ECLRMbits_t SBT16ECLRMbits __asm__ ("SBT16ECLRM") __attribute__((section("sfrs"), address(0xBF92C438)));
#define SBT16REG0 SBT16REG0
extern volatile uint32_t   SBT16REG0 __attribute__((section("sfrs"), address(0xBF92C440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT16REG0bits_t;
extern volatile __SBT16REG0bits_t SBT16REG0bits __asm__ ("SBT16REG0") __attribute__((section("sfrs"), address(0xBF92C440)));
#define SBT16RD0 SBT16RD0
extern volatile uint32_t   SBT16RD0 __attribute__((section("sfrs"), address(0xBF92C450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16RD0bits_t;
extern volatile __SBT16RD0bits_t SBT16RD0bits __asm__ ("SBT16RD0") __attribute__((section("sfrs"), address(0xBF92C450)));
#define SBT16WR0 SBT16WR0
extern volatile uint32_t   SBT16WR0 __attribute__((section("sfrs"), address(0xBF92C458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16WR0bits_t;
extern volatile __SBT16WR0bits_t SBT16WR0bits __asm__ ("SBT16WR0") __attribute__((section("sfrs"), address(0xBF92C458)));
#define SBT16REG1 SBT16REG1
extern volatile uint32_t   SBT16REG1 __attribute__((section("sfrs"), address(0xBF92C460)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT16REG1bits_t;
extern volatile __SBT16REG1bits_t SBT16REG1bits __asm__ ("SBT16REG1") __attribute__((section("sfrs"), address(0xBF92C460)));
#define SBT16RD1 SBT16RD1
extern volatile uint32_t   SBT16RD1 __attribute__((section("sfrs"), address(0xBF92C470)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16RD1bits_t;
extern volatile __SBT16RD1bits_t SBT16RD1bits __asm__ ("SBT16RD1") __attribute__((section("sfrs"), address(0xBF92C470)));
#define SBT16WR1 SBT16WR1
extern volatile uint32_t   SBT16WR1 __attribute__((section("sfrs"), address(0xBF92C478)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16WR1bits_t;
